package geekUniversityAndroid.alg.lesson06;

public class MainLesson06 {

    /*
      ФИО:  		    Свищ Владимир Сергеевич
      Факультет:        Geek University Android-разработки
      Курс: 		    Алгоритмы и структуры данных на Java.
      Урок: 		    Урок 6. Деревья
      Дата правки:      06.08.2020
    */

    public static void main(String[] args) {
        /*
        1. Создать и запустить программу для построения двоичного дерева.
        В цикле построить двадцать деревьев с глубиной в 6 уровней. Данные,
        которыми необходимо заполнить узлы деревьев, представляются в виде чисел типа int.
        Число, которое попадает в узел, должно генерироваться случайным образом в диапазоне от -100 до 100.

        2. Проанализировать, какой процент созданных деревьев являются несбалансированными.
        */

    }
}
