package geekUniversityAndroid.alg.lesson07;

public class MainLesson07 {

    /*
      ФИО:  		    Свищ Владимир Сергеевич
      Факультет:        Geek University Android-разработки
      Курс: 		    Алгоритмы и структуры данных на Java.
      Урок: 		    Урок 7. Графы
      Дата правки:      10.08.2020
    */

    public static void main(String[] args) {

        /*
        1. Реализовать программу, в которой задается граф из 10 вершин.
        Задать ребра и найти кратчайший путь с помощью поиска в ширину. Так же укажите длину пути.
        */
        findGraph();
        
        /*
        2 *. Сделать рефакторинг кода, унаследовав от одного касса классы обхода в глубину и ширину.
        */

    }

    private static void findGraph() {
    }
}
