package geekUniversityAndroid.quarter1.javaCoreAdvancedLevel.lesson01;

  /*
	    ФИО:  		    Свищ Владимир Сергеевич
	    Факультет:      Geek University Android-разработки
	    Курс: 		    Java Core. Продвинутый уровень
	    Урок: 		    Урок 1. Объектно-ориентированное программирование Java
	    Дата правки:    14.06.2020
  */

public class MainLesson01 {
    public static void main(String[] args) {

    /*
        1. Создайте три класса Человек, Кот, Робот, которые не наследуются от одного класса.
           Эти классы должны уметь бегать и прыгать (методы просто выводят информацию о действии
           в консоль).
        2. Создайте два класса: беговая дорожка и стена, при прохождении через которые,
           участники должны выполнять соответствующие действия (бежать или прыгать),
           результат выполнения печатаем в консоль (успешно пробежал, не смог пробежать и т.д.).
        3. Создайте два массива: с участниками и препятствиями, и заставьте всех участников
           пройти этот набор препятствий.
        4. * У препятствий есть длина (для дорожки) или высота (для стены), а участников
           ограничения на бег и прыжки. Если участник не смог пройти одно из препятствий,
           то дальше по списку он препятствий не идет.
        5. * Задание с перечислениями. (текст прикреплен в материалах)
    */
    }
}
