package geekUniversityAndroid.quarter1.javaCoreAdvancedLevel.lesson02;

  /*
	    ФИО:  		    Свищ Владимир Сергеевич
	    Факультет:      Geek University Android-разработки
	    Курс: 		    Java Core. Продвинутый уровень
	    Урок: 		    Урок 2. Исключения
	    Дата правки:    17.06.2020
  */

public class MainLesson02 {
    public static void main(String[] args) {
    /*
        1. Напишите метод, на вход которого подается двумерный строковый массив
           размером 4х4, при подаче массива другого размера необходимо бросить
           исключение MyArraySizeException.

        2. Далее метод должен пройтись по всем элементам массива, преобразовать
           в int, и просуммировать. Если в каком-то элементе массива преобразование
           не удалось (например, в ячейке лежит символ или текст вместо числа),
           должно быть брошено исключение MyArrayDataException – с детализацией,
           в какой именно ячейке лежат неверные данные.

        3. В методе main() вызвать полученный метод, обработать возможные
           исключения MySizeArrayException и MyArrayDataException и вывести
           результат расчета.
    */
    }
}
